capturandolinksenorgmode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-01 Sun 16:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Capturando links en org-mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a href="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Capturando links en org-mode</h1>
<div id="outline-container-org5a176f6" class="outline-2">
<h2 id="org5a176f6">Capturando links</h2>
<div class="outline-text-2" id="text-org5a176f6">
<p>
El objetivo de este post es describir el proceso que uso para capturar links
desde Firefox y almacenarlos en un archivo de org-mode, que puede leerse luego
desde el propio navegador.
</p>
</div>
</div>

<div id="outline-container-org71f7515" class="outline-2">
<h2 id="org71f7515">Org-capture</h2>
<div class="outline-text-2" id="text-org71f7515">
<p>
La primera parte será activar <code>org-capture</code> y <code>org-protocol</code> en Emacs. <a href="https://www.gnu.org/software/emacs/manual/html_node/org/Capture.html#Capture">org-capture</a>
puede ser usado también para escribir pequeñas ideas y almacenarlas en ficheros org
rápidamente; pero, en este caso, lo usaremos sólo para recibir el link desde Firefox.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #8ac6f2; font-weight: bold;">require</span> '<span style="color: #e5786d;">org-protocol</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Lo primero que debemos hacer es definir la plantilla que queremos usar para capturar
los links. La sintaxis usada se explica en la <a href="https://www.gnu.org/software/emacs/manual/html_node/org/Template-expansion.html#Template-expansion">documentación</a> de org-mode, así como
las opciones que usa después:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #8ac6f2; font-weight: bold;">setq</span> org-capture-templates
      <span style="color: #BFEBBF;">(</span><span style="color: #8ac6f2; font-weight: bold;">quote</span> <span style="color: #D0BF8F;">(</span>
              <span style="color: #93E0E3;">(</span><span style="color: #95e454;">"x"</span> <span style="color: #95e454;">"org-protocol"</span> entry <span style="color: #9FC59F;">(</span>file <span style="color: #95e454;">"~/links.org"</span><span style="color: #9FC59F;">)</span>
               <span style="color: #95e454;">"** %c %?"</span> <span style="color: #e5786d; font-weight: bold;">:kill-buffer</span> t <span style="color: #e5786d; font-weight: bold;">:prepend</span> t<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
En este caso, guardará los links en un archivo llamado <code>links.org</code> en el directorio
<code>home</code>. Pueden añadirse <a href="https://www.gnu.org/software/emacs/manual/html_node/org/Template-elements.html#Template-elements">opciones</a> para explicitar en qué punto exacto del archivo
queremos insertar el link una vez lo capturemos.
</p>
</div>
</div>

<div id="outline-container-org7c075ea" class="outline-2">
<h2 id="org7c075ea">Extensión de firefox</h2>
<div class="outline-text-2" id="text-org7c075ea">
<p>
El uso de <code>org-protocol</code> desde Firefox puede gestionarse más detalladamente usando
<a href="http://orgmode.org/worg/org-contrib/org-protocol.html#sec-4">marcadores</a> que activen la captura. En nuestro caso, como sólo necesitamos la configuración
básica, podemos ahorrarnos este trabajo y dejárselo a la extensión <a href="http://chadok.info/firefox-org-capture/">org-capture for Firefox</a>.
</p>

<p>
La extensión nos deja elegir en sus opciones si queremos que use una nueva ventana (me
parece lo más conveniente y además veremos cómo controlarla luego con i3); la letra
asignada a la plantilla (en nuestro caso hemos usado la <code>x</code> en la configuración
anterior); y el atajo de teclado para activarla, que por defecto es <code>Ctrl-Alt-r</code>.
</p>

<p>
Una vez activemos la extensión, podremos capturar enlaces pulsando el atajo.
</p>
</div>
</div>

<div id="outline-container-org97e03f0" class="outline-2">
<h2 id="org97e03f0">Cerrando ventanas</h2>
<div class="outline-text-2" id="text-org97e03f0">
<p>
Un problema menor al usar esta extensión es que crea ventanas de Emacs que no cierra
al terminar. Otro problema es que suele crear también un buffer inicial al lado de nuestro
buffer de captura. Podemos usar <b>hooks</b> para forzarlo a corregir ese comportamiento:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>add-hook 'org-capture-mode-hook 'delete-other-windows<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-hook 'org-capture-after-finalize-hook 'delete-frame<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2c6835" class="outline-2">
<h2 id="orge2c6835">Integrándolo en i3</h2>
<div class="outline-text-2" id="text-orge2c6835">
<p>
Para los usuarios de i3, puede ser útil poder controlar dónde y cómo se crea la ventana
de captura de Emacs. Un ejemplo de configuración es la siguiente, que coloca la ventana
como flotante y en el centro de la pantalla; como si fuera un popup:
</p>

<div class="org-src-container">
<pre class="src src-bash">for_window <span style="color: #DCDCCC;">[</span><span style="color: #cae682;">class</span>=<span style="color: #95e454;">"Emacs"</span> <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"CAPTURE"</span><span style="color: #DCDCCC;">]</span> floating enable
for_window <span style="color: #DCDCCC;">[</span><span style="color: #cae682;">class</span>=<span style="color: #95e454;">"Emacs"</span> <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"CAPTURE"</span><span style="color: #DCDCCC;">]</span> resize set 1880 480
for_window <span style="color: #DCDCCC;">[</span><span style="color: #cae682;">class</span>=<span style="color: #95e454;">"Emacs"</span> <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"CAPTURE"</span><span style="color: #DCDCCC;">]</span> move position center
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f471d1" class="outline-2">
<h2 id="org8f471d1">Mostrando los links en el navegador</h2>
<div class="outline-text-2" id="text-org8f471d1">
<p>
Para que además los links se muestren en el navegador, pueden usarse también <b>hooks</b> que
se activen al guardado para exportar a HTML. En este post de <a href="https://rafaelleru.github.io/2017/01/22/to_read_list_emacs/">@rafaelleru</a> se explica el
proceso en detalle.
</p>
</div>
</div>

<div id="outline-container-org956b742" class="outline-2">
<h2 id="org956b742">Un detalle sin solucionar</h2>
<div class="outline-text-2" id="text-org956b742">
<p>
En la plantilla de captura, me gustaría poder usar además <code>%^g</code>, que crea un pequeño
diálogo donde insertar tags al link que se está guardando. El problema con esto es que,
hasta que ese diálogo no ha terminado, no se ejecutan los hooks y el frame no se hace
único (ni se reposiciona en i3).</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2017-03-23 Thu 14:54. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
